/**
 * (PHP 4, PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/function.count-chars.php
 * @param string $string [optional] <p> TODO DESCRIPTION </p>
 * @param int $mode [optional] <p> TODO DESCRIPTION </p>
 * @return mixed mode の値により、
 * count_chars は以下の値のどれかを返します。
 * 0 - 各バイト値をキー、各バイトの出現回数を値とする配列。
 * 1 - 0と同じですが、各バイト値の出現回数がゼロより大きいものの一覧となります。
 * 2 - 0と同じですが、各バイト値の出現回数がゼロであるものの一覧となります。
 * 3 - すべての一意な文字を含む文字列を返します。
 * 4 - 使用されていない全ての文字を含む文字列を返します。modecount_chars0 - 各バイト値をキー、各バイトの出現回数を値とする配列。
 * 1 - 0と同じですが、各バイト値の出現回数がゼロより大きいものの一覧となります。
 * 2 - 0と同じですが、各バイト値の出現回数がゼロであるものの一覧となります。
 * 3 - すべての一意な文字を含む文字列を返します。
 * 4 - 使用されていない全ての文字を含む文字列を返します。0 - 各バイト値をキー、各バイトの出現回数を値とする配列。0 - 各バイト値をキー、各バイトの出現回数を値とする配列。1 - 0と同じですが、各バイト値の出現回数がゼロより大きいものの一覧となります。1 - 0と同じですが、各バイト値の出現回数がゼロより大きいものの一覧となります。2 - 0と同じですが、各バイト値の出現回数がゼロであるものの一覧となります。2 - 0と同じですが、各バイト値の出現回数がゼロであるものの一覧となります。3 - すべての一意な文字を含む文字列を返します。3 - すべての一意な文字を含む文字列を返します。4 - 使用されていない全ての文字を含む文字列を返します。4 - 使用されていない全ての文字を含む文字列を返します。
 */
function count_chars($string, $mode) {}