/**
 * (PHP 4, PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/function.get-declared-classes.php
 * @return array この関数は、現在のスクリプトで宣言されたクラスの名前の配列を返します。PHP にコンパイル時に組み込んだり読み込んだりしている拡張モジュールの種類に依存して、
 * 他のクラスも存在する可能性があることに注意しましょう。
 * これは、自作のクラスをそれらと同じ名前で作成できないことを意味します。
 * 定義済みのクラスについては付録の定義済みクラスのセクションを
 * 参照してください。PHP にコンパイル時に組み込んだり読み込んだりしている拡張モジュールの種類に依存して、
 * 他のクラスも存在する可能性があることに注意しましょう。
 * これは、自作のクラスをそれらと同じ名前で作成できないことを意味します。
 * 定義済みのクラスについては付録の定義済みクラスのセクションを
 * 参照してください。定義済みクラス
 */
function get_declared_classes() {}