/**
 * (PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/mysqli-result.fetch-field.php
 * @param mysqli_result $result [optional] <p> TODO DESCRIPTION </p>
 * @return object フィールド定義情報を含むオブジェクトを返します。もし
 * フィールドの情報が取得できない場合は、FALSE を返します。FALSEオブジェクトのプロパティ
 * プロパティ
 * 説明
 * name
 * カラムの名前。
 * orgname
 * もしエイリアスが指定されている場合の、本来の名前。
 * table
 * フィールドが属するテーブルの名前。
 * orgtable
 * もしエイリアスが指定されている場合の、本来のテーブル名。
 * def
 * デフォルト値のために予約済。現在は常に ""。
 * db
 * データベース (PHP 5.3.6 以降)。
 * catalog
 * カタログ名。常に "def" (PHP 5.3.6 以降)。
 * max_length
 * 結果セットにおけるフィールドの最大幅。
 * length
 * テーブルの定義で指定されているフィールド幅。
 * charsetnr
 * フィールドの文字セット番号。
 * flags
 * フィールドのビットフラグを整数型で表す。
 * type
 * フィールドのデータ型。
 * decimals
 * フィールドの桁数（integer 型のフィールド）。オブジェクトのプロパティ
 * プロパティ
 * 説明
 * name
 * カラムの名前。
 * orgname
 * もしエイリアスが指定されている場合の、本来の名前。
 * table
 * フィールドが属するテーブルの名前。
 * orgtable
 * もしエイリアスが指定されている場合の、本来のテーブル名。
 * def
 * デフォルト値のために予約済。現在は常に ""。
 * db
 * データベース (PHP 5.3.6 以降)。
 * catalog
 * カタログ名。常に "def" (PHP 5.3.6 以降)。
 * max_length
 * 結果セットにおけるフィールドの最大幅。
 * length
 * テーブルの定義で指定されているフィールド幅。
 * charsetnr
 * フィールドの文字セット番号。
 * flags
 * フィールドのビットフラグを整数型で表す。
 * type
 * フィールドのデータ型。
 * decimals
 * フィールドの桁数（integer 型のフィールド）。プロパティ
 * 説明
 * name
 * カラムの名前。
 * orgname
 * もしエイリアスが指定されている場合の、本来の名前。
 * table
 * フィールドが属するテーブルの名前。
 * orgtable
 * もしエイリアスが指定されている場合の、本来のテーブル名。
 * def
 * デフォルト値のために予約済。現在は常に ""。
 * db
 * データベース (PHP 5.3.6 以降)。
 * catalog
 * カタログ名。常に "def" (PHP 5.3.6 以降)。
 * max_length
 * 結果セットにおけるフィールドの最大幅。
 * length
 * テーブルの定義で指定されているフィールド幅。
 * charsetnr
 * フィールドの文字セット番号。
 * flags
 * フィールドのビットフラグを整数型で表す。
 * type
 * フィールドのデータ型。
 * decimals
 * フィールドの桁数（integer 型のフィールド）。プロパティ
 * 説明プロパティ
 * 説明プロパティ説明name
 * カラムの名前。
 * orgname
 * もしエイリアスが指定されている場合の、本来の名前。
 * table
 * フィールドが属するテーブルの名前。
 * orgtable
 * もしエイリアスが指定されている場合の、本来のテーブル名。
 * def
 * デフォルト値のために予約済。現在は常に ""。
 * db
 * データベース (PHP 5.3.6 以降)。
 * catalog
 * カタログ名。常に "def" (PHP 5.3.6 以降)。
 * max_length
 * 結果セットにおけるフィールドの最大幅。
 * length
 * テーブルの定義で指定されているフィールド幅。
 * charsetnr
 * フィールドの文字セット番号。
 * flags
 * フィールドのビットフラグを整数型で表す。
 * type
 * フィールドのデータ型。
 * decimals
 * フィールドの桁数（integer 型のフィールド）。name
 * カラムの名前。nameカラムの名前。orgname
 * もしエイリアスが指定されている場合の、本来の名前。orgnameもしエイリアスが指定されている場合の、本来の名前。table
 * フィールドが属するテーブルの名前。tableフィールドが属するテーブルの名前。orgtable
 * もしエイリアスが指定されている場合の、本来のテーブル名。orgtableもしエイリアスが指定されている場合の、本来のテーブル名。def
 * デフォルト値のために予約済。現在は常に ""。defデフォルト値のために予約済。現在は常に ""。db
 * データベース (PHP 5.3.6 以降)。dbデータベース (PHP 5.3.6 以降)。catalog
 * カタログ名。常に "def" (PHP 5.3.6 以降)。catalogカタログ名。常に "def" (PHP 5.3.6 以降)。max_length
 * 結果セットにおけるフィールドの最大幅。max_length結果セットにおけるフィールドの最大幅。length
 * テーブルの定義で指定されているフィールド幅。lengthテーブルの定義で指定されているフィールド幅。charsetnr
 * フィールドの文字セット番号。charsetnrフィールドの文字セット番号。flags
 * フィールドのビットフラグを整数型で表す。flagsフィールドのビットフラグを整数型で表す。type
 * フィールドのデータ型。typeフィールドのデータ型。decimals
 * フィールドの桁数（integer 型のフィールド）。decimalsフィールドの桁数（integer 型のフィールド）。
 */
function mysqli_fetch_field($result) {}