/**
 * (PECL newt >= 0.1)<br/>
 * @link http://php.net/manual/en/function.newt-run-form.php
 * @param resource $form [optional] <p> TODO DESCRIPTION </p>
 * @return resource フォームの実行を停止させたコンポーネントを返します。この関数は、newt の通常の名前付け規則に当てはまらないことに注意
 * しましょう。これは古いインターフェイスであり、すべてのフォームで
 * 動作するわけではありません。これは、昔のアプリケーションのために
 * だけ newt に残されています。しかし、この関数のインターフェイスは
 * newt_form_run よりシンプルであるため、
 * 結果としていまだに頻繁に利用されています。
 * アプリケーションが終了した際には、フォームおよびそこに含まれる
 * すべてのコンポーネントは破壊されます。この関数は、newt の通常の名前付け規則に当てはまらないことに注意
 * しましょう。これは古いインターフェイスであり、すべてのフォームで
 * 動作するわけではありません。これは、昔のアプリケーションのために
 * だけ newt に残されています。しかし、この関数のインターフェイスは
 * newt_form_run よりシンプルであるため、
 * 結果としていまだに頻繁に利用されています。
 * アプリケーションが終了した際には、フォームおよびそこに含まれる
 * すべてのコンポーネントは破壊されます。newt_form_run
 */
function newt_run_form($form) {}