/**
 * (PHP 4, PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/function.posix-times.php
 * @return array 現在のプロセスの CPU 使用状況に関する情報を表す文字列を連想配列
 * として返します。連想配列のキーは次のようになります。
 * ticks - リブートからの経過クロック数。
 * utime - 現在のプロセスにより使用されているユーザー時間。
 * stime - 現在のプロセスにより使用されているシステム時間。
 * cutime - 現在のプロセスおよび子プロセスにより使用されているユーザー時間。
 * cstime - 現在のプロセスおよび子プロセスにより使用されているシステム時間。ticks - リブートからの経過クロック数。
 * utime - 現在のプロセスにより使用されているユーザー時間。
 * stime - 現在のプロセスにより使用されているシステム時間。
 * cutime - 現在のプロセスおよび子プロセスにより使用されているユーザー時間。
 * cstime - 現在のプロセスおよび子プロセスにより使用されているシステム時間。ticks - リブートからの経過クロック数。ticks - リブートからの経過クロック数。utime - 現在のプロセスにより使用されているユーザー時間。utime - 現在のプロセスにより使用されているユーザー時間。stime - 現在のプロセスにより使用されているシステム時間。stime - 現在のプロセスにより使用されているシステム時間。cutime - 現在のプロセスおよび子プロセスにより使用されているユーザー時間。cutime - 現在のプロセスおよび子プロセスにより使用されているユーザー時間。cstime - 現在のプロセスおよび子プロセスにより使用されているシステム時間。cstime - 現在のプロセスおよび子プロセスにより使用されているシステム時間。
 */
function posix_times() {}