/**
 * (PHP 4, PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/function.posix-getgrnam.php
 * @param string $name [optional] <p> TODO DESCRIPTION </p>
 * @return array 以下の要素を持つ配列を返します。
 * グループ情報の配列
 * 要素
 * 説明
 * name
 * グループ名。これは、16 文字以下の短い文字列からなる
 * 「ハンドル」であり、実際の完全な名前とは異なります。
 * グループ ID。この関数をコールする際に指定した
 * name と同じものになるので、冗長なデータです。
 * passwd
 * グループのパスワードを暗号化したもの。
 * システムが「シャドー」パスワードを使用している場合は、
 * ここではアスタリスクが返されます。
 * gid
 * グループ ID を表す数値。
 * members
 * このグループに属する全メンバーを表す文字列の配列。グループ情報の配列
 * 要素
 * 説明
 * name
 * グループ名。これは、16 文字以下の短い文字列からなる
 * 「ハンドル」であり、実際の完全な名前とは異なります。
 * グループ ID。この関数をコールする際に指定した
 * name と同じものになるので、冗長なデータです。
 * passwd
 * グループのパスワードを暗号化したもの。
 * システムが「シャドー」パスワードを使用している場合は、
 * ここではアスタリスクが返されます。
 * gid
 * グループ ID を表す数値。
 * members
 * このグループに属する全メンバーを表す文字列の配列。要素
 * 説明
 * name
 * グループ名。これは、16 文字以下の短い文字列からなる
 * 「ハンドル」であり、実際の完全な名前とは異なります。
 * グループ ID。この関数をコールする際に指定した
 * name と同じものになるので、冗長なデータです。
 * passwd
 * グループのパスワードを暗号化したもの。
 * システムが「シャドー」パスワードを使用している場合は、
 * ここではアスタリスクが返されます。
 * gid
 * グループ ID を表す数値。
 * members
 * このグループに属する全メンバーを表す文字列の配列。要素
 * 説明要素
 * 説明要素説明name
 * グループ名。これは、16 文字以下の短い文字列からなる
 * 「ハンドル」であり、実際の完全な名前とは異なります。
 * グループ ID。この関数をコールする際に指定した
 * name と同じものになるので、冗長なデータです。
 * passwd
 * グループのパスワードを暗号化したもの。
 * システムが「シャドー」パスワードを使用している場合は、
 * ここではアスタリスクが返されます。
 * gid
 * グループ ID を表す数値。
 * members
 * このグループに属する全メンバーを表す文字列の配列。name
 * グループ名。これは、16 文字以下の短い文字列からなる
 * 「ハンドル」であり、実際の完全な名前とは異なります。
 * グループ ID。この関数をコールする際に指定した
 * name と同じものになるので、冗長なデータです。nameグループ名。これは、16 文字以下の短い文字列からなる
 * 「ハンドル」であり、実際の完全な名前とは異なります。
 * グループ ID。この関数をコールする際に指定した
 * name と同じものになるので、冗長なデータです。namepasswd
 * グループのパスワードを暗号化したもの。
 * システムが「シャドー」パスワードを使用している場合は、
 * ここではアスタリスクが返されます。passwdグループのパスワードを暗号化したもの。
 * システムが「シャドー」パスワードを使用している場合は、
 * ここではアスタリスクが返されます。gid
 * グループ ID を表す数値。gidグループ ID を表す数値。members
 * このグループに属する全メンバーを表す文字列の配列。membersこのグループに属する全メンバーを表す文字列の配列。
 */
function posix_getgrnam($name) {}