/**
 * (PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/function.variant-mul.php
 * @param mixed $left [optional] <p> TODO DESCRIPTION </p>
 * @param mixed $right [optional] <p> TODO DESCRIPTION </p>
 * @return mixed Variant の乗算規則
 * もし～なら
 * このようにします
 * 両者ともに文字列型・日付型・文字・論理型
 * 乗算
 * 一方が文字列型で、もう一方が文字
 * 乗算
 * 一方が数値で、もう一方が文字列
 * 乗算
 * 両者ともに数値
 * 乗算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返されるVariant の乗算規則
 * もし～なら
 * このようにします
 * 両者ともに文字列型・日付型・文字・論理型
 * 乗算
 * 一方が文字列型で、もう一方が文字
 * 乗算
 * 一方が数値で、もう一方が文字列
 * 乗算
 * 両者ともに数値
 * 乗算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返されるもし～なら
 * このようにします
 * 両者ともに文字列型・日付型・文字・論理型
 * 乗算
 * 一方が文字列型で、もう一方が文字
 * 乗算
 * 一方が数値で、もう一方が文字列
 * 乗算
 * 両者ともに数値
 * 乗算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返されるもし～なら
 * このようにしますもし～なら
 * このようにしますもし～ならこのようにします両者ともに文字列型・日付型・文字・論理型
 * 乗算
 * 一方が文字列型で、もう一方が文字
 * 乗算
 * 一方が数値で、もう一方が文字列
 * 乗算
 * 両者ともに数値
 * 乗算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返される両者ともに文字列型・日付型・文字・論理型
 * 乗算両者ともに文字列型・日付型・文字・論理型乗算一方が文字列型で、もう一方が文字
 * 乗算一方が文字列型で、もう一方が文字乗算一方が数値で、もう一方が文字列
 * 乗算一方が数値で、もう一方が文字列乗算両者ともに数値
 * 乗算両者ともに数値乗算どちらか一方が NULL
 * NULL が返されるどちらか一方が NULLNULL が返される両者ともに空の値
 * 空の文字列が返される両者ともに空の値空の文字列が返される
 */
function variant_mul($left, $right) {}