/**
 * (PHP 5, PHP 7)<br/>
 * @link http://php.net/manual/en/function.variant-sub.php
 * @param mixed $left [optional] <p> TODO DESCRIPTION </p>
 * @param mixed $right [optional] <p> TODO DESCRIPTION </p>
 * @return mixed Variant の減算規則
 * もし～なら
 * このようにします
 * 両者ともに文字列型
 * 減算
 * 一方が文字列型で、もう一方が文字
 * 減算
 * 一方が数値で、もう一方が文字列
 * 減算
 * 両者ともに数値
 * 減算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返されるVariant の減算規則
 * もし～なら
 * このようにします
 * 両者ともに文字列型
 * 減算
 * 一方が文字列型で、もう一方が文字
 * 減算
 * 一方が数値で、もう一方が文字列
 * 減算
 * 両者ともに数値
 * 減算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返されるもし～なら
 * このようにします
 * 両者ともに文字列型
 * 減算
 * 一方が文字列型で、もう一方が文字
 * 減算
 * 一方が数値で、もう一方が文字列
 * 減算
 * 両者ともに数値
 * 減算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返されるもし～なら
 * このようにしますもし～なら
 * このようにしますもし～ならこのようにします両者ともに文字列型
 * 減算
 * 一方が文字列型で、もう一方が文字
 * 減算
 * 一方が数値で、もう一方が文字列
 * 減算
 * 両者ともに数値
 * 減算
 * どちらか一方が NULL
 * NULL が返される
 * 両者ともに空の値
 * 空の文字列が返される両者ともに文字列型
 * 減算両者ともに文字列型減算一方が文字列型で、もう一方が文字
 * 減算一方が文字列型で、もう一方が文字減算一方が数値で、もう一方が文字列
 * 減算一方が数値で、もう一方が文字列減算両者ともに数値
 * 減算両者ともに数値減算どちらか一方が NULL
 * NULL が返されるどちらか一方が NULLNULL が返される両者ともに空の値
 * 空の文字列が返される両者ともに空の値空の文字列が返される
 */
function variant_sub($left, $right) {}